## SQL-Type Operation

If you know something about relational databases and SQL, you may have heard of JOIN and GROUP BY.

In [1]:
import pandas as pd

## Joining

In [2]:
mlo = pd.read_csv('./Pandas Dataset - I/co2-mm-mlo.csv', na_values=-99.99, index_col='Date', parse_dates=True)
gl = pd.read_csv('./Pandas Dataset - I/co2-mm-gl.csv', na_values=-99.99, index_col='Date', parse_dates=True)
print(mlo,gl)

            Decimal Date  Average  Interpolated   Trend  Number of Days
Date
1958-03-01      1958.208   315.71        315.71  314.62              -1
1958-04-01      1958.292   317.45        317.45  315.29              -1
1958-05-01      1958.375   317.50        317.50  314.71              -1
1958-06-01      1958.458      NaN        317.10  314.85              -1
1958-07-01      1958.542   315.86        315.86  314.98              -1
...                  ...      ...           ...     ...             ...
2016-08-01      2016.625   402.25        402.25  404.09              23
2016-09-01      2016.708   401.03        401.03  404.52              24
2016-10-01      2016.792   401.57        401.57  404.93              29
2016-11-01      2016.875   403.53        403.53  405.57              27
2016-12-01      2016.958   404.48        404.48  405.25              29

[706 rows x 5 columns]             Decimal Date  Average   Trend
Date
1980-01-01      1980.042   338.45  337.82
1980-02-01      1980.125   339.14  338.10
1980-03-01      1980.208   339.46  338.12
1980-04-01      1980.292   339.86  338.24
1980-05-01      1980.375   340.30  338.77
...                  ...      ...     ...
2016-06-01      2016.458   403.35  402.83
2016-07-01      2016.542   401.85  403.23
2016-08-01      2016.625   400.55  403.34
2016-09-01      2016.708   400.68  403.39
2016-10-01      2016.792   402.31  403.73

[442 rows x 3 columns]

In [3]:
ml, gl = mlo[['Average']], gl[['Average']]
print(ml,gl)

            Average
Date
1958-03-01   315.71
1958-04-01   317.45
1958-05-01   317.50
1958-06-01      NaN
1958-07-01   315.86
...             ...
2016-08-01   402.25
2016-09-01   401.03
2016-10-01   401.57
2016-11-01   403.53
2016-12-01   404.48

[706 rows x 1 columns]             Average
Date
1980-01-01   338.45
1980-02-01   339.14
1980-03-01   339.46
1980-04-01   339.86
1980-05-01   340.30
...             ...
2016-06-01   403.35
2016-07-01   401.85
2016-08-01   400.55
2016-09-01   400.68
2016-10-01   402.31

[442 rows x 1 columns]

In [5]:
ml.columns, gl.columns = ['Average_mlo'], ['Average_gl']
print(ml,gl)

            Average_mlo
Date
1958-03-01       315.71
1958-04-01       317.45
1958-05-01       317.50
1958-06-01          NaN
1958-07-01       315.86
...                 ...
2016-08-01       402.25
2016-09-01       401.03
2016-10-01       401.57
2016-11-01       403.53
2016-12-01       404.48

[706 rows x 1 columns]             Average_gl
Date
1980-01-01      338.45
1980-02-01      339.14
1980-03-01      339.46
1980-04-01      339.86
1980-05-01      340.30
...                ...
2016-06-01      403.35
2016-07-01      401.85
2016-08-01      400.55
2016-09-01      400.68
2016-10-01      402.31

[442 rows x 1 columns]

In [6]:
ml = ml[ml.index >= '1980-01']
print(ml)

            Average_mlo
Date
1980-01-01       337.90
1980-02-01       338.34
1980-03-01       340.01
1980-04-01       340.93
1980-05-01       341.48
...                 ...
2016-08-01       402.25
2016-09-01       401.03
2016-10-01       401.57
2016-11-01       403.53
2016-12-01       404.48

[444 rows x 1 columns]

In [7]:
ml, gl = ml.head(), gl.head()
print(ml, gl)

            Average_mlo
Date
1980-01-01       337.90
1980-02-01       338.34
1980-03-01       340.01
1980-04-01       340.93
1980-05-01       341.48             Average_gl
Date
1980-01-01      338.45
1980-02-01      339.14
1980-03-01      339.46
1980-04-01      339.86
1980-05-01      340.30

We can concatenate the two DataFrames.

In [8]:
pd.concat([ml, gl])

            Average_mlo  Average_gl
Date
1980-01-01       337.90         NaN
1980-02-01       338.34         NaN
1980-03-01       340.01         NaN
1980-04-01       340.93         NaN
1980-05-01       341.48         NaN
1980-01-01          NaN      338.45
1980-02-01          NaN      339.14
1980-03-01          NaN      339.46
1980-04-01          NaN      339.86
1980-05-01          NaN      340.30

Alternatively, the above can be obtained with the self-describing `append()` method.

In [9]:
ml.append(gl)

            Average_mlo  Average_gl
Date
1980-01-01       337.90         NaN
1980-02-01       338.34         NaN
1980-03-01       340.01         NaN
1980-04-01       340.93         NaN
1980-05-01       341.48         NaN
1980-01-01          NaN      338.45
1980-02-01          NaN      339.14
1980-03-01          NaN      339.46
1980-04-01          NaN      339.86
1980-05-01          NaN      340.30

By default, `concat()` concatenates along the rows (axis 0). What we did previously was 'concatenating' along the columns (axis 1). It is actually a join operation, on (index or *key*) `Date`.

In [10]:
pd.concat([ml, gl], axis=1)

            Average_mlo  Average_gl
Date
1980-01-01       337.90      338.45
1980-02-01       338.34      339.14
1980-03-01       340.01      339.46
1980-04-01       340.93      339.86
1980-05-01       341.48      340.30

Indeed, we could alternatively use the `join()` method.

In [11]:
ml.join(gl)

            Average_mlo  Average_gl
Date
1980-01-01       337.90      338.45
1980-02-01       338.34      339.14
1980-03-01       340.01      339.46
1980-04-01       340.93      339.86
1980-05-01       341.48      340.30

Wait! Which frame's index is used? JOIN can be left, right, outer, or inner (picture unions and intersections).

In [12]:
mlo = pd.read_csv('./Pandas Dataset - I/co2-mm-mlo.csv', na_values=-99.99, index_col='Date', parse_dates=True)
mlo = mlo[['Average']]
mlo.head()

            Average
Date
1958-03-01   315.71
1958-04-01   317.45
1958-05-01   317.50
1958-06-01      NaN
1958-07-01   315.86

In [13]:
mlo.join(gl)

            Average  Average_gl
Date
1958-03-01   315.71         NaN
1958-04-01   317.45         NaN
1958-05-01   317.50         NaN
1958-06-01      NaN         NaN
1958-07-01   315.86         NaN
...             ...         ...
2016-08-01   402.25         NaN
2016-09-01   401.03         NaN
2016-10-01   401.57         NaN
2016-11-01   403.53         NaN
2016-12-01   404.48         NaN

[706 rows x 2 columns]

In [14]:
mlo.join(gl, how='inner') #only common index value will select...

            Average  Average_gl
Date
1980-01-01   337.90      338.45
1980-02-01   338.34      339.14
1980-03-01   340.01      339.46
1980-04-01   340.93      339.86
1980-05-01   341.48      340.30

## Grouping

We introduce the split-apply-combine approach:

* split the data into groups;

* apply a function to each group independently;

* combine the results into an appropriate data structure.

In [19]:
z = pd.Series([0.5, 0.8, 0.1, 0.3], index=pd.MultiIndex.from_product([[0, 1], [0, 1]], names=['x', 'y']))

In [20]:
z

x  y
0  0    0.5
   1    0.8
1  0    0.1
   1    0.3
dtype: float64

In [21]:
z.groupby('x')

In [22]:
z.groupby('x').apply(lambda u: u.min())

x
0    0.5
1    0.1
dtype: float64

The function in question is an aggregation (for each group, return the minimum value). The length of the result is the number of different groups (here, number of unique x values). Aggregation reduces the size of the data structure.

In [23]:
z.groupby(level=0).apply(lambda u: u.min())

x
0    0.5
1    0.1
dtype: float64

The aggregation function can be applied directly, if it is available.

In [24]:
z.groupby('x').min()

x
0    0.5
1    0.1
dtype: float64

With a hierarchical index, the level parameter can even be passed directly to certain aggregation functions.

In [25]:
z.min(level='x')

x
0    0.5
1    0.1
dtype: float64

In [27]:
z.min(level=0)

x
0    0.5
1    0.1
dtype: float64

Counting the number of records in each group is also an aggregation.

In [29]:
z.groupby('x').size()

x
0    2
1    2
dtype: int64

For each unique values of x (which are 0 and 1), we have two entries.

The grouping object (here, x) is referred to as the key.

In [30]:
z.groupby(['x', 'y']).size()

x  y
0  0    1
   1    1
1  0    1
   1    1
dtype: int64

In [38]:
z.groupby('x').describe()

   count  mean       std  min    25%   50%    75%  max
x
0    2.0  0.65  0.212132  0.5  0.575  0.65  0.725  0.8
1    2.0  0.20  0.141421  0.1  0.150  0.20  0.250  0.3

In [39]:
z.groupby('y').describe()

   count  mean       std  min    25%   50%    75%  max
y
0    2.0  0.30  0.282843  0.1  0.200  0.30  0.400  0.5
1    2.0  0.55  0.353553  0.3  0.425  0.55  0.675  0.8

In [40]:
import numpy as np

In [41]:
z.groupby('y').apply(lambda u: np.std(u, ddof=1))

y
0    0.282843
1    0.353553
dtype: float64

In [42]:
z.groupby('y').apply(lambda u: np.std(u))

y
0    0.20
1    0.25
dtype: float64

In [43]:
z.groupby('y').apply(np.std)

y
0    0.20
1    0.25
dtype: float64

Filtering is another kind of operation which can be applied to each group. Filtering may reduce the size of the data structure, since some groups might get filtered out.

In [44]:
z

x  y
0  0    0.5
   1    0.8
1  0    0.1
   1    0.3
dtype: float64

In [45]:
z.groupby('y').apply(lambda u: u.min() > 0.4)

y
0    False
1    False
dtype: bool

In [46]:
z.groupby('y').min()

y
0    0.1
1    0.3
dtype: float64

In [47]:
z.groupby('y').filter(lambda u: u.min() > 0.4)

Series([], dtype: float64)

The third kind of operation is transformation, where the size of the data structure is preserved.

In [48]:
z.groupby('y').transform(lambda u: u.min())

x  y
0  0    0.1
   1    0.3
1  0    0.1
   1    0.3
dtype: float64